app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("customer_id", "input", "output", "date_of_transaction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["customer_id", 1001], ["input", "5000"], ["output", "10,000"], ["date_of_transaction", "2023-05-12"], ["created_at", "2022-03-13 04:14:14.716551"], ["updated_at", "2022-03-13 04:14:14.716551"]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.date_of_transaction = Time.now
    if @transaction.valid?
      @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])